In [1]:
import numpy as np
import pandas as pd

import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

# Import Dataset

In [108]:
xls_path = pd.ExcelFile('/Users/dileepsathyan/Documents/GitHub/Assignments/Vroom Virtusa/Analytics_Dataset.xlsx')
df_car_sales   = pd.read_excel(xls_path, 'car_sales')
df_car_details = pd.read_excel(xls_path, 'car_details')
df_car_claims  = pd.read_excel(xls_path, 'car_claims')

In [109]:
df_car_sales.head()

,car_id_sales,country,merchant_id,selling_date,selling_week,payment_date,sell_price,transport_to_merchant,transport_date
0,3421775349,ES,NaN,2021-04-29,2021-17,2021-05-14,1098,1,2021-05-31
1,5316743932,DE,NaN,2021-08-06,2021-31,2021-08-17,435,1,2021-08-31
2,5785159431,FR,NaN,2021-06-03,2021-22,2021-06-08,11028,0,NaN
3,7008763171,DE,NaN,2021-06-07,2021-23,2021-06-08,21100,1,NaN
4,1417558732,DE,NaN,2021-08-31,2021-35,2021-09-02,1943,1,2021-09-09

In [101]:
df_car_details.head()

,car_id_details,has_tuning,has_airbags,has_alarm_system,fuel_type,gear_type,ac_type,xenon_light,navigation_system,radio_system
0,5096178328,1,1,0,1039,1141,1049,0,1100,3534.0
1,1879501444,0,1,1,1039,1138,1049,0,0,3534.0
2,8375508078,1,1,1,1039,1139,0,0,0,1606.0
3,1266330246,0,1,0,1040,1139,1050,0,0,3534.0
4,9079520882,0,0,0,1039,1141,0,0,1100,3534.0

In [102]:
df_car_claims.head()

,car_id_claims,claim_number,full_refunds,partial_refunds,voucher_amount,claim_status
0,7525691980,NaN,0,0,NaN,NaN
1,8543168465,C1AG79687,0,1,620.140528,CLOSED_FULLY_PROCESSED
2,7308726237,NaN,0,0,NaN,NaN
3,9070724843,NaN,0,0,NaN,NaN
4,6274074693,NaN,0,0,NaN,NaN

# Data Cleaning

## 1. Car_Sales Dataframe Cleaning

In [110]:
df_car_sales.shape

(70512, 9)

In [111]:
df_car_sales.drop_duplicates(inplace=True)
df_car_sales.shape

(69618, 9)

In [112]:
df_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 69618 entries, 0 to 70511
Data columns (total 9 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   car_id_sales           69618 non-null  int64
 1   country                69618 non-null  object
 2   merchant_id            19088 non-null  float64
 3   selling_date           69618 non-null  object
 4   selling_week           69618 non-null  object
 5   payment_date           69618 non-null  object
 6   sell_price             69618 non-null  int64
 7   transport_to_merchant  69618 non-null  int64
 8   transport_date         32689 non-null  object
dtypes: float64(1), int64(3), object(5)
memory usage: 5.3+ MB

#### Convert to right datatypes

In [113]:
df_car_sales['car_id_sales'] = df_car_sales['car_id_sales'].astype('str')
df_car_sales['merchant_id'] = df_car_sales['merchant_id'].astype('str')

df_car_sales['selling_date'] = pd.to_datetime(df_car_sales['selling_date'])
df_car_sales['payment_date'] = pd.to_datetime(df_car_sales['payment_date'])
df_car_sales['transport_date'] = pd.to_datetime(df_car_sales['transport_date'])

# Rename primary column
df_car_sales.rename(columns={'car_id_sales': 'car_id'}, inplace=True)

# Reset index
df_car_sales.reset_index(inplace=True)

df_car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 69618 entries, 0 to 69617
Data columns (total 10 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   index                  69618 non-null  int64
 1   car_id                 69618 non-null  object
 2   country                69618 non-null  object
 3   merchant_id            69618 non-null  object
 4   selling_date           69618 non-null  datetime64[ns]
 5   selling_week           69618 non-null  object
 6   payment_date           69618 non-null  datetime64[ns]
 7   sell_price             69618 non-null  int64
 8   transport_to_merchant  69618 non-null  int64
 9   transport_date         32689 non-null  datetime64[ns]
dtypes: datetime64[ns](3), int64(3), object(4)
memory usage: 5.3+ MB

## Car_Details Dataframe Cleaning

In [114]:
df_car_details.shape

(70512, 10)

In [115]:
df_car_details.drop_duplicates(inplace=True)
df_car_details.shape

(70034, 10)

In [116]:
df_car_details.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70034 entries, 0 to 70511
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   car_id_details     70034 non-null  int64
 1   has_tuning         70034 non-null  int64
 2   has_airbags        70034 non-null  int64
 3   has_alarm_system   70034 non-null  int64
 4   fuel_type          70034 non-null  int64
 5   gear_type          70034 non-null  int64
 6   ac_type            70034 non-null  int64
 7   xenon_light        70034 non-null  int64
 8   navigation_system  70034 non-null  int64
 9   radio_system       43494 non-null  float64
dtypes: float64(1), int64(9)
memory usage: 5.9 MB

#### Convert to right datatypes

In [117]:
df_car_details['car_id_details'] = df_car_details['car_id_details'].astype('str')

# Rename primary column
df_car_details.rename(columns={'car_id_details': 'car_id'}, inplace=True)

# Reset index
df_car_details.reset_index(inplace=True)

df_car_details.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70034 entries, 0 to 70033
Data columns (total 11 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   index              70034 non-null  int64
 1   car_id             70034 non-null  object
 2   has_tuning         70034 non-null  int64
 3   has_airbags        70034 non-null  int64
 4   has_alarm_system   70034 non-null  int64
 5   fuel_type          70034 non-null  int64
 6   gear_type          70034 non-null  int64
 7   ac_type            70034 non-null  int64
 8   xenon_light        70034 non-null  int64
 9   navigation_system  70034 non-null  int64
 10  radio_system       43494 non-null  float64
dtypes: float64(1), int64(9), object(1)
memory usage: 5.9+ MB

## Car_Claims Dataframe Cleaning

In [118]:
df_car_claims.shape

(70512, 6)

In [119]:
df_car_claims.drop_duplicates(inplace=True)
df_car_claims.shape

(70504, 6)

In [120]:
df_car_claims.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 70504 entries, 0 to 70511
Data columns (total 6 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   car_id_claims    70504 non-null  int64
 1   claim_number     19974 non-null  object
 2   full_refunds     70504 non-null  int64
 3   partial_refunds  70504 non-null  int64
 4   voucher_amount   15173 non-null  float64
 5   claim_status     19974 non-null  object
dtypes: float64(1), int64(3), object(2)
memory usage: 3.8+ MB

#### Convert to right datatypes

In [121]:
df_car_claims['car_id_claims'] = df_car_claims['car_id_claims'].astype('str')
df_car_claims['claim_number'] = df_car_claims['claim_number'].astype('str')

# Rename primary column
df_car_claims.rename(columns={'car_id_claims': 'car_id'}, inplace=True)

# Reset index
df_car_claims.reset_index(inplace=True)

df_car_claims.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 70504 entries, 0 to 70503
Data columns (total 7 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   index            70504 non-null  int64
 1   car_id           70504 non-null  object
 2   claim_number     70504 non-null  object
 3   full_refunds     70504 non-null  int64
 4   partial_refunds  70504 non-null  int64
 5   voucher_amount   15173 non-null  float64
 6   claim_status     19974 non-null  object
dtypes: float64(1), int64(3), object(3)
memory usage: 3.8+ MB

# Combine the dataframes to 1

In [122]:
df_car_sales.shape

(69618, 10)

In [123]:
df_car_details.shape

(70034, 11)

In [124]:
df_car_claims.shape

(70504, 7)

In [125]:
df_merged = pd.merge(df_car_claims, df_car_details, how='inner', on='car_id')
df_merged = pd.merge(df_merged, df_car_sales, how='inner', on='car_id')
df_merged.head()

,index_x,car_id,claim_number,full_refunds,partial_refunds,voucher_amount,claim_status,index_y,has_tuning,has_airbags,...,radio_system,index,country,merchant_id,selling_date,selling_week,payment_date,sell_price,transport_to_merchant,transport_date
0,0,7525691980,nan,0,0,NaN,NaN,23408,1,1,...,NaN,49261,DE,nan,2021-06-15,2021-24,2021-06-21,2721,1,2021-06-28
1,1,8543168465,C1AG79687,0,1,620.140528,CLOSED_FULLY_PROCESSED,40876,0,0,...,3534.0,55375,NL,11655609.0,2021-06-30,2021-26,2021-07-01,3150,0,NaT
2,2,7308726237,nan,0,0,NaN,NaN,66353,0,1,...,NaN,34964,ES,nan,2021-04-18,2021-15,2021-04-21,1764,1,2021-04-23
3,3,9070724843,nan,0,0,NaN,NaN,39946,0,1,...,3534.0,14933,ES,nan,2021-04-24,2021-16,2021-04-26,292,1,2021-04-29
4,4,6274074693,nan,0,0,NaN,NaN,32611,0,1,...,3534.0,27464,DE,nan,2021-05-17,2021-20,2021-05-18,11033,0,NaT

In [126]:
df_merged.shape

(71732, 26)